---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalDefinitions
source: html/49b6a297-3c1c-1c4b-85e3-68cdebb69b68.htm
---
# ExternalDefinitions Properties

Identifies if the definitions collection is empty.